# Уникални PIN кодове
# Да се напише програма, която генерира трицифрени PIN кодове, като цифрите на всеки PIN код са в определен интервал.
# За да бъде валиден един PIN код той трябва да отговаря на следните условия:
# Първата и третата цифра трябва да бъдат четни.
# Втората цифра трябва да бъде просто число в диапазона [2...7].



for _ in range(2):
    number = int(input())
    for x1 in range(1, number):
        for x2 in range(1, number):
            for x3 in range(1, number):
                if x1 % 2 == 0 and x3 % 2 == 0:
                    print(f"{x1} {x2} {x3}")
                    continue
        number = int(input())


# Вход
# От конзолата се четат 3 реда:
# Горната граница на първото число - цяло число в диапазона [1...9]
# Горната граница на второто число - цяло число в диапазона [1...9]
# Горната граница на третото число - цяло число в диапазона [1...9]
# Изход
# Да се отпечатат на конзолата всички валидни трицифрени PIN кодове, чиито цифри отговарят на съответните интервали.
