# Напишете програма, която да намира сладкаря с най-висок резултат. В началото на конкурса се въвежда броя на козунаците,
# които ще бъдат дегустирани от посетителите на пекарната, като за всеки козунак различен брой посетители, ще дадат оценка от 1 до 10.

import sys
cake_count = int(input())
max_score = -sys.maxsize

points = 0

for _ in range(cake_count):
    chef_name = input()
    score = input()
    while score != "Stop":
        # if score == "Stop":
        #     print(f"{chef_name} has {max_score} points.")
        #     continue
        points += int(score)
        if points > max_score:
            max_score = points
        score = input()

# Вход
# Първоначално от конзолата се прочита броя на козунаците – цяло число в интервала [1… 100]
# След това за всеки козунак се прочита:
# Името на пекаря, който е направил козунака – текст
# До получаване на командата "Stop" се прочита
# оценка за козунак от един човек  – цяло число в интервала [1... 10]


      #       # След получаване на командата "Stop" се печата един ред:

#print(f"{current_best_chef} is the new number 1!") # Ако след командата "Stop", пекарят е с най-много точки до момента, да се отпечата допълнителен ред:

#print(f"{best_chef} won competition with {points} points!") # След дегустация на всички козунаци, да се отпечата един ред:
