# Напишете програма, която да принтира на конзолата всички комбинации от 3 букви в зададен интервал,
# като се пропускат комбинациите съдържащи зададена от конзолата буква.
# Накрая трябва да се изпринтира броят на отпечатаните комбинации.

# Вход
# Входът се чете от конзолата и съдържа точно 3 реда:
# Малка буква от английската азбука за начало на интервала – от ‘a’ до ‚z’.
# Малка буква от английската азбука за край на интервала  – от първата буква до ‚z’.
# Малка буква от английската азбука – от ‘a’ до ‚z’ – като комбинациите съдържащи тази буквата се пропускат.

letter1 = input()
letter2 = input()
letter3 = input()





# Изход
# Да се отпечатат на един ред всички комбинации отговарящи на условието плюс броят им разделени с интервал.
